from operator import index

# 1. https://github.com/leemiran0729
# 다음 깃헙 url에서 미란이의 사용자명을 출력하시오

# string = "https://github.com/leemiran0729"
# idx = string.rfind('/')
# print(string[idx+1:])
#
# a = string.split('/')
# print(a[-1])

# -----------------------------------------------------------------------------------------

# 2. li = [a, b, c, d]
# 사용자가 입력한 문자하나가 li에 포함되어있는지 확인하시오. 단 대문자 소문자 가리지 않음

# li = ['a', 'b', 'c', 'd']
# string = input()
# if string.isupper():
#     string = string.lower()
#
# if string in li:
#     print('T')
# else:
#     print('F')

# -----------------------------------------------------------------------------------------

# 3. dic = {'Kang' : 'Mirae', 'Lee' : 'Miran'}에서 키 값에 K가 들어가면 이름을 출력하시오.

# dic = {'Kang' : 'Mirae', 'Lee' : 'Miran'}
# dic_key = list(dic.keys())
# if 'K' in dic_key[0] :
#     print('t')
# if 'K' in dic_key[1] :
#     print('t')

# -----------------------------------------------------------------------------------------


# 4. 강미래는 미란의 이름을 질투해 개명하기로 했다. 강미래 -> 강미란으로 변경하시오 (내장함수사용할것)

# name = '강미래'
# print(name.replace('래','란'))

# -----------------------------------------------------------------------------------------

# 5. '미란짱★' 아이디 맨 뒤의 기호를 5번 출력하시오

# string = '미란짱★'
# print(string[-1]*5)

# -----------------------------------------------------------------------------------------

# 6. dic = {'K': 20, 'L': 32} L의 나이를 출력하시오

# dic = {'K': 20, 'L': 32}
# print(dic['L'])

# -----------------------------------------------------------------------------------------

# 7. (0, 1, 2, 3, 4, 5)에서 별 표현식을 사용해 가운데 4개만 가져오세요

# _, *a, _ = (0, 1, 2, 3, 4, 5)
# print(a)

# -----------------------------------------------------------------------------------------

# 8. 가져온 데이터를 역순으로 출력하세요

# print(a[::-1])

# -----------------------------------------------------------------------------------------

# 9. [2, 5, 4, 8, 1]를 오름차순으로 출력해주세요

# l = [2, 5, 4, 8, 1]
# print(l.sort())

# -----------------------------------------------------------------------------------------

# 10. [123, 345, 351] 3개 원소 중 백의 자리가 3인 것만 출력하시오. (반복문X)

# l = [123, 345, 351]
# result = []
#
# if 299 < l[0] < 401 :
#     result.append(l[0])
# if 299 < l[1] < 401 :
#     result.append(l[1])
# if 299 < l[2] < 401 :
#     result.append(l[2])
#
# print(result)
#
# x = l[0]/100
# y = l[1]/100
# z = l[2]/100